const countryptions = [
  // القاهرة تمام 1
  {
    value: "القاهرة",
    label: "القاهرة",
    children: [
      {
        value: "قاهرة",
        label: "قاهرة",
      },
      {
        value: "العبور",
        label: "العبور",
      },
      {
        value: "الشروق",
        label: "الشروق",
      },
      {
        value: "السلام اول",
        label: "السلام اول",
      },
      {
        value: "السلام ثاني",
        label: "السلام ثاني",
      },
      {
        value: "المرج",
        label: "المرج",
      },
      {
        value: "المطرية",
        label: "المطرية",
      },
      {
        value: "النزهة",
        label: "النزهة",
      },
      {
        value: "عين شمس",
        label: "عين شمس",
      },
      {
        value: "مدينة نصر شرق",
        label: "مدينة نصر غرب",
      },
      {
        value: "مصر الجديدة",
        label: "مصر الجديدة",
      },
      {
        value: "الازبكية",
        label: "الازبكية",
      },
      {
        value: "الموسكي",
        label: "الموسكي",
      },
      {
        value: "الوايلي",
        label: "الوايلي",
      },
      {
        value: "باب الشعرية",
        label: "باب الشعرية",
      },

      {
        value: "بولاق",
        label: "بولاق",
      },
      {
        value: "بولاق ابوالعلا",
        label: "بولاق ابوالعلا",
      },
      {
        value: "عابدين",
        label: "عابدين",
      },
      {
        value: "غرب",
        label: "غرب",
      },
      {
        value: "منشأة ناصر",
        label: "منشأة ناصر",
      },
      {
        value: "وسط",
        label: "وسط",
      },
      {
        value: "عتبة",
        label: "عتبة",
      },
      {
        value: "التحرير",
        label: "التحرير",
      },
      {
        value: "حي 15مايو",
        label: "حي 15مايو",
      },
      {
        value: "البساتين",
        label: "البساتين",
      },
      {
        value: "التبين",
        label: "التبين",
      },
      {
        value: "الخليفة",
        label: "الخليفة",
      },
      {
        value: "السيدة زينب",
        label: "السيدة زينب",
      },
      {
        value: "المعادي",
        label: "المعادي",
      },
      {
        value: "المعصرة",
        label: "المعصرة",
      },
      {
        value: "المقطم",
        label: "المقطم",
      },
      {
        value: "حلوان",
        label: "حلوان",
      },
      {
        value: "دار السلام",
        label: "دار السلام",
      },
      {
        value: "طرة",
        label: "طرة",
      },
      {
        value: "مصر القديمة",
        label: "مصر القديمة",
      },
      {
        value: "الاميرية",
        label: "الاميرية",
      },
      {
        value: "الزاوية الجمرا",
        label: "الزاوية الحمرا",
      },
      {
        value: "الزيتون",
        label: "الزيتون",
      },
      {
        value: "الساحل",
        label: "الساحل",
      },
      {
        value: "الشرابية",
        label: "الشرابية",
      },
      {
        value: "السبتية",
        label: "السبتية",
      },
      {
        value: "رمسيس",
        label: "رمسيس",
      },
      {
        value: "حدايق القبة",
        label: "حدايق القبة",
      },
      {
        value: "روض الفرج",
        label: "روض الفرج",
      },
      {
        value: "شيرا",
        label: "شبرا",
      },
      {
        value: "اول القاهرة",
        label: "اول القاهرة",
      },
      {
        value: "ثاني القاهرة",
        label: "ثاني القاهرة",
      },
      {
        value: "ثالث القاهرة",
        label: "ثالث القاهرة",
      },
      {
        value: "بدر",
        label: "بدر",
      },
    ],
  },

  {
    value: "القاهرة الجديدة",
    label: "القاهرة الجديدة",
    children: [
      {
        value: "التجمع الخامس",
        label: "التجمع الخامس",
      },
      {
        value: "النرجس",
        label: "النرجس",
      },
      {
        value: "المستثمرين الجنوبية",
        label: "المستثمرين الجنوبية",
      },
      {
        value: "الاندلس",
        label: "الاندلس",
      },
      {
        value: "اللوتس",
        label: "اللوتس",
      },
      {
        value: "البنفسج",
        label: "البنفسج",
      },
      {
        value: "المستثمرين الشمالية",
        label: "المستثمرين الشمالية",
      },
      {
        value: "الياسمين",
        label: "الياسمين",
      },
      {
        value: "القاهرة الجديدة",
        label: "القاهرة الجديدة",
      },
    ],
  },
  // الجيزة تمام 2
  {
    value: "الجيزة",
    label: "الجيزة",

    children: [
      {
        value: "جيزة",
        label: "جيزة",
      },
      {
        value: "المهندسين",
        label: "المهندسين",
      },
      {
        value: "العجوزة",
        label: "العجوزة",
      },
      {
        value: "الكيت كات",
        label: "الكيت كات",
      },
      {
        value: "إمبابة",
        label: "إمبابة",
      },
      {
        value: "الوراق",
        label: "الوراق",
      },
      {
        value: "وراق العرب",
        label: "وراق العرب",
      },
      {
        value: "طناش",
        label: "طناش",
      },
      {
        value: "جزيرة محمد",
        label: "جزيرة محمد",
      },
      {
        value: "برقاش",
        label: "برقاش",
      },
      {
        value: "نكلا",
        label: "نكلا",
      },
      {
        value: "بشتيل",
        label: "بشتيل",
      },
      {
        value: "البراجيل",
        label: "البراجيل",
      },
      {
        value: "كفر حكيم",
        label: "كفر حكيم",
      },
      {
        value: "أبو رواش",
        label: "أبو رواش",
      },
      {
        value: "المنطقة الصناعية",
        label: "المنطقة الصناعية",
      },
      {
        value: "القطا",
        label: "القطا",
      },
      {
        value: "المنطقة الاستثمارية",
        label: "المنطقة الاستثمارية",
      },
      {
        value: "بني مجدول",
        label: "بني مجدول",
      },
      {
        value: "كرداسة",
        label: "كرداسة",
      },
      {
        value: "أوسيم",
        label: "أوسيم",
      },
      {
        value: "المنصورية",
        label: "المنصورية",
      },
      {
        value: "منشأة رضوان",
        label: "منشأة رضوان",
      },
      {
        value: "الشيخ زايد",
        label: "الشيخ زايد",
      },
      {
        value: "المعتمدية",
        label: "المعتمدية",
      },
      {
        value: "ناهيا",
        label: "ناهيا",
      },
      {
        value: "صفط",
        label: "صفط",
      },
      {
        value: "منشأة البكاري",
        label: "منشأة البكاري",
      },
      {
        value: "كفر غطاطي",
        label: "كفر غطاطي",
      },
      {
        value: "بولاق الدكرور",
        label: "بولاق الدكرور",
      },
      {
        value: "ميدان لبنان",
        label: "ميدان لبنان",
      },
      {
        value: "ميت عقبة",
        label: "ميت عقبة",
      },

      {
        value: "الدقي",
        label: "الدقي",
      },

      {
        value: "الجيزة",
        label: "الجيزة",
      },
      {
        value: "الهرم",
        label: "الهرم",
      },
      {
        value: "فيصل",
        label: "فيصل",
      },
      {
        value: "العمرانية",
        label: "العمرانية",
      },
      {
        value: "كفر الملكة",
        label: "كفر الملكة",
      },
      {
        value: "كفر طهرمس",
        label: "كفر طهرمس",
      },

      {
        value: "أم المصريين",
        label: "أم المصريين",
      },
      {
        value: "أبو هريرة",
        label: "أبو هريرة",
      },
      {
        value: "المأمون",
        label: "المأمون",
      },
      {
        value: "سوق الأحد",
        label: "سوق الأحد",
      },
      {
        value: "أمير الجيش",
        label: "أمير الجيش",
      },
      {
        value: "نادي رابعة",
        label: "نادي رابعة",
      },
      {
        value: "شوكلى",
        label: "شوكلى",
      },
      {
        value: "مساكن بنزايون",
        label: "مساكن بنزايون",
      },
      {
        value: "6 أكتوبر",
        label: "6 أكتوبر",
      },
      {
        value: "ساقية مكي",
        label: "ساقية مكي",
      },
      {
        value: "جزيرة الدهب",
        label: "جزيرة الدهب",
      },
      {
        value: "جزيرة البحرين",
        label: "جزيرة البحرين",
      },
      {
        value: "القرية الفرعونية",
        label: "القرية الفرعونية",
      },
      {
        value: "كولدير",
        label: "كولدير",
      },

      {
        value: "المنيب",
        label: "المنيب",
      },
      {
        value: "القصبجي",
        label: "القصبجي",
      },
      {
        value: "عزبة البكباشي",
        label: "عزبة البكباشي",
      },
      {
        value: "أبو النمرس",
        label: "أبو النمرس",
      },
      {
        value: "نزلة الأشطر",
        label: "نزلة الأشطر",
      },
      {
        value: "ترسا",
        label: "ترسا",
      },
      {
        value: "بني يوسف",
        label: "بني يوسف",
      },
      {
        value: "الحرانية",
        label: "الحرانية",
      },
      {
        value: "زاوية أبومسلم",
        label: "زاوية أبومسلم",
      },
      {
        value: "منيل شيحة",
        label: "منيل شيحة",
      },
      {
        value: "ميت قادوس",
        label: "ميت قادوس",
      },
      {
        value: "أبو صير",
        label: "أبو صير",
      },
      {
        value: "ميت شماس",
        label: "ميت شماس",
      },
      {
        value: "المنوات",
        label: "المنوات",
      },
      {
        value: "طموه",
        label: "طموه",
      },
      {
        value: "الشيخ عتمان",
        label: "الشيخ عتمان",
      },
      {
        value: "أم خنان",
        label: "أم خنان",
      },
      {
        value: "الحوامدية",
        label: "الحوامدية",
      },
      {
        value: "العزيزية",
        label: "العزيزية",
      },

      {
        value: "سقارة",
        label: "سقارة",
      },
      {
        value: "البدرشين",
        label: "البدرشين",
      },
      {
        value: "طرفاية",
        label: "طرفاية",
      },
      {
        value: "المرازيق",
        label: "المرازيق",
      },
      {
        value: "أبو رجوان",
        label: "أبو رجوان",
      },
      {
        value: "الشوبك",
        label: "الشوبك",
      },
      {
        value: "دهشور",
        label: "دهشور",
      },
      {
        value: "الغمازة",
        label: "الغمازة",
      },
      {
        value: "الصف",
        label: "الصف",
      },
      {
        value: "كفر ترك",
        label: "كفر ترك",
      },
      {
        value: "منشأة أبي العباس",
        label: "منشأة أبي العباس",
      },
    ],
  },
  // اسكندرية تمام 3
  {
    value: "الاسكندرية",
    label: "الاسكندرية",

    children: [
      {
        value: "اسكندرية",
        label: "اسكندرية",
      },
      {
        value: "ابو قير",
        label: "ابو قير",
      },
      {
        value: "اسكندريه",
        label: "اسكندريه",
      },
      {
        value: "الابراهيمية",
        label: "الابراهيمية",
      },
      {
        value: "الازاريطه",
        label: "الازاريطه",
      },
      {
        value: "الانفوشى",
        label: "الانفوشى",
      },
      {
        value: "الحضره",
        label: "الحضره",
      },
      {
        value: "الدخيله",
        label: "الدخيله",
      },
      {
        value: "السرايا",
        label: "السرايا",
      },
      {
        value: "السيوف",
        label: "السيوف",
      },
      {
        value: "الشاطبى",
        label: "الشاطبى",
      },
      {
        value: "العجمى",
        label: "العجمى",
      },
      {
        value: "العصافره",
        label: "العصافره",
      },
      {
        value: "العطارين",
        label: "العطارين",
      },
      {
        value: "القبارى",
        label: "القبارى",
      },
      {
        value: "اللبان",
        label: "اللبان",
      },
      {
        value: "المعموره",
        label: "المعموره",
      },
      {
        value: "المكس",
        label: "المكس",
      },
      {
        value: "المنتزه",
        label: "المنتزه",
      },
      {
        value: "المندره",
        label: "المندره",
      },
      {
        value: "المنشية",
        label: "المنشية",
      },
      {
        value: "الورديان",
        label: "الورديان",
      },

      {
        value: "باكوس",
        label: "باكوس",
      },
      {
        value: "بحرى",
        label: "بحرى",
      },
      {
        value: "بولكلى",
        label: "بولكلى",
      },

      {
        value: "ثروت",
        label: "ثروت",
      },

      {
        value: "جليم",
        label: "جليم",
      },
      {
        value: "جناكليس",
        label: "جناكليس",
      },

      {
        value: "الجمرك",
        label: "الجمرك",
      },
      {
        value: "العامرية",
        label: "العامرية",
      },
      {
        value: "كليوباترا",
        label: "كليوباترا",
      },
      {
        value: "ميامى",
        label: "ميامى",
      },

      {
        value: "رأس التين",
        label: "رأس التين",
      },
      {
        value: "رشدى",
        label: "رشدى",
      },

      {
        value: "زيزينيا",
        label: "زيزينيا",
      },

      {
        value: "سابا باشا",
        label: "سابا باشا",
      },
      {
        value: "سان ستيفانو",
        label: "سان ستيفانو",
      },
      {
        value: "سبورتنج",
        label: "سبورتنج",
      },
      {
        value: "ستانلى",
        label: "ستانلى",
      },
      {
        value: "سموحه",
        label: "سموحه",
      },
      {
        value: "سيدى بشر",
        label: "سيدى بشر",
      },
      {
        value: "سيدى جابر",
        label: "سيدى جابر",
      },

      {
        value: "شدس",
        label: "شدس",
      },

      {
        value: "صفر",
        label: "صفر",
      },

      {
        value: "فكتوريا",
        label: "فكتوريا",
      },
      {
        value: "فلمنج",
        label: "فلمنج",
      },

      {
        value: "كامب شيزار",
        label: "كامب شيزار",
      },
      {
        value: "كرموز",
        label: "كرموز",
      },
      {
        value: "كفر عبده",
        label: "كفر عبده",
      },
      {
        value: "كوم الدكة",
        label: "كوم الدكة",
      },
      {
        value: "كونت زيزينيا",
        label: "كونت زيزينيا",
      },

      {
        value: "لوران",
        label: "لوران",
      },

      {
        value: "محرم بك",
        label: "محرم بك",
      },
      {
        value: "محطة الرمل",
        label: "محطة الرمل",
      },

      {
        value: "ميدان المنشيه",
        label: "ميدان المنشيه",
      },
    ],
  },
  // الدقهلية تمام 4
  {
    value: "الدقهلية",
    label: "الدقهلية",

    children: [
      {
        value: "دقهلية",
        label: "دقهلية",
      },
      {
        value: "أجا",
        label: "أجا",
      },
      {
        value: "الستاموني",
        label: "الستاموني",
      },
      {
        value: "بلقاس",
        label: "بلقاس",
      },
      {
        value: "بني عبيد",
        label: "بني عبيد",
      },
      {
        value: "تمي الأمديد",
        label: "تمي الأمديد",
      },
      {
        value: "الجمالية",
        label: "الجمالية",
      },
      {
        value: "دكرنس",
        label: "دكرنس",
      },
      {
        value: "السنبلاوين",
        label: "السنبلاوين",
      },
      {
        value: "شربين",
        label: "شربين",
      },
      {
        value: "طلخا",
        label: "طلخا",
      },
      {
        value: "الكردي",
        label: "الكردي",
      },
      {
        value: "محلة دمنة",
        label: "محلة دمنة",
      },
      {
        value: "المطرية",
        label: "المطرية",
      },
      {
        value: "المنزلة",
        label: "المنزلة",
      },
      {
        value: "المنصورة",
        label: "المنصورة",
      },
      {
        value: "منية النصر",
        label: "منية النصر",
      },
      {
        value: "ميت سلسيل",
        label: "ميت سلسيل",
      },
      {
        value: "ميت غمر",
        label: "ميت غمر",
      },
      {
        value: "نبروه",
        label: "نبروه",
      },
      {
        value: "جمصة",
        label: "جمصة",
      },
    ],
  },
  // الشرقية تمام 5
  {
    value: "الشرقية",
    label: "الشرقية",
    children: [
      {
        value: "شرقية",
        label: "شرقية",
      },
      {
        value: "الزقازيق",
        label: "الزقازيق",
      },
      {
        value: "الحسينية",
        label: "الحسينية",
      },
      {
        value: "فاقوس",
        label: "فاقوس",
      },
      {
        value: "بلبيس",
        label: "بلبيس",
      },
      {
        value: "منيا القمح",
        label: "منيا القمح",
      },
      {
        value: "أبو حماد",
        label: "أبو حماد",
      },
      {
        value: "اولاد صقر",
        label: "اولاد صقر",
      },
      {
        value: "العاشر من رمضان",
        label: "العاشر من رمضان",
      },
      {
        value: "الصالحية الجديدة",
        label: "الصالحية الجديدة",
      },
      {
        value: "الصالحية القديمة",
        label: "الصالحية القديمة",
      },
      {
        value: "كفر صقر",
        label: "كفر صقر",
      },
      {
        value: "أبو كبير",
        label: "أبو كبير",
      },
      {
        value: "القنايات",
        label: "القنايات",
      },
      {
        value: "مشتول السوق",
        label: "مشتول السوق",
      },
      {
        value: "ديرب نجم",
        label: "ديرب نجم",
      },
      {
        value: "الإبراهيمية",
        label: "الإبراهيمية",
      },
      {
        value: "ههيا",
        label: "ههيا",
      },
      {
        value: "القرين",
        label: "القرين",
      },
      {
        value: "صان الحجر",
        label: "صان الحجر",
      },
    ],
  },
  // البحيرة تمام 6
  {
    value: "البحيرة",
    label: "البحيرة",
    children: [
      {
        value: "بحيرة",
        label: "بحيرة",
      },
      {
        value: "أبو المطامير",
        label: "أبو المطامير",
      },
      {
        value: "أبو حمص",
        label: "أبو حمص",
      },
      {
        value: "إدكو",
        label: "إدكو",
      },
      {
        value: "إيتاي البارود",
        label: "إيتاي البارود",
      },
      {
        value: "بدر",
        label: "بدر",
      },
      {
        value: "حوش عيسى",
        label: "حوش عيسى",
      },
      {
        value: "الدلنجات",
        label: "الدلنجات",
      },
      {
        value: "دمنهور",
        label: "دمنهور",
      },
      {
        value: "الرحمانية",
        label: "الرحمانية",
      },
      {
        value: "رشيد",
        label: "رشيد",
      },
      {
        value: "شبراخيت",
        label: "شبراخيت",
      },
      {
        value: "كفر الدوار",
        label: "كفر الدوار",
      },
      {
        value: "كوم حمادة",
        label: "كوم حمادة",
      },
      {
        value: "المحمودية",
        label: "المحمودية",
      },
      {
        value: "وادي النطرون",
        label: "وادي النطرون",
      },
    ],
  },
  // الفيوم تمام 7
  {
    value: "الفيوم",
    label: "الفيوم",
    children: [
      {
        value: "الفيوم",
        label: "الفيوم",
      },
      {
        value: "إبشواي",
        label: "إبشواي",
      },
      {
        value: "إطسا",
        label: "إطسا",
      },
      {
        value: "سنورس",
        label: "سنورس",
      },
      {
        value: "طامية",
        label: "طامية",
      },
      {
        value: "يوسف الصديق",
        label: "يوسف الصديق",
      },
    ],
  },
  // الغربية تمام 8
  {
    value: "الغربية",
    label: "الغربية",
    children: [
      {
        value: "غربية",
        label: "غربية",
      },
      {
        value: "كفر الزيات",
        label: "كفر الزيات",
      },
      {
        value: "السنطة",
        label: "السنطة",
      },
      {
        value: "المحلة الكبرى",
        label: "المحلة الكبرى",
      },
      {
        value: "بسيون",
        label: "بسيون",
      },
      {
        value: "زفتى",
        label: "زفتى",
      },
      {
        value: "سمنود",
        label: "سمنود",
      },
      {
        value: "طنطا",
        label: "طنطا",
      },
      {
        value: "قطور",
        label: "قطور",
      },
    ],
  },
  // الاسماعيلية تمام 9
  {
    value: "الاسماعيلية",
    label: "الاسماعيلية",
    children: [
      {
        value: "أبو صوير",
        label: "أبو صوير",
      },
      {
        value: "اسماعيلية",
        label: "اسماعيلية",
      },
      {
        value: "التل الكبير",
        label: "التل الكبير",
      },
      {
        value: "فايد",
        label: "فايد",
      },
      {
        value: "فايد",
        label: "فايد",
      },
      {
        value: "القصاصين",
        label: "القصاصين",
      },
      {
        value: "القنطرة شرق",
        label: "القنطرة شرق",
      },
      {
        value: "القنطرة غرب",
        label: "القنطرة غرب",
      },
    ],
  },
  // السويس تمام 10
  {
    value: "السويس",
    label: "السويس",
    children: [
      {
        value: "سويس",
        label: "سويس",
      },
      {
        value: "الأربعين",
        label: "الأربعين",
      },
      {
        value: "الكويت",
        label: "الكويت",
      },
      {
        value: "عتاقة",
        label: "عتاقة",
      },
      {
        value: "الجناين",
        label: "الجناين",
      },
      {
        value: "فيصل",
        label: "فيصل",
      },
    ],
  },
  // بورسعيد تمام 11
  {
    value: "بورسعيد",
    label: "بورسعيد",
    children: [
      {
        value: "حي الشرق",
        label: "حي الشرق",
      },
      {
        value: "حي المناخ",
        label: "حي المناخ",
      },
      {
        value: "حي الجنوب",
        label: "حي الجنوب",
      },
      {
        value: "العرب",
        label: "العرب",
      },
      {
        value: "حي الضواحي",
        label: "حي الضواحي",
      },
      {
        value: "بور فؤاد",
        label: "بور فؤاد",
      },
      {
        value: "الزهور",
        label: "الزهور",
      },
      {
        value: "المنطقة الحرة",
        label: "المنطقة الحرة",
      },
      {
        value: "بور توفيق",
        label: "بور توفيق",
      },
      {
        value: "حي مبارك",
        label: "حي مبارك",
      },
      {
        value: "جنوب بورسعيد",
        label: "جنوب بورسعيد",
      },
      {
        value: "الافرنج",
        label: "الافرنج",
      },
      {
        value: "حي الكويت",
        label: "حي الكويت",
      },
      {
        value: "المنشية",
        label: "المنشية",
      },
      {
        value: "الثلاثيني",
        label: "الثلاثيني",
      },
      {
        value: "المنطقة الصناعية",
        label: "المنطقة الصناعية",
      },
      {
        value: "العاشر من رمضان",
        label: "العاشر من رمضان",
      },
      {
        value: "الجولف",
        label: "الجولف",
      },
      {
        value: "الجمهورية",
        label: "الجمهورية",
      },
      {
        value: "المناصرة",
        label: "المناصرة",
      },
      {
        value: "شرق التفريعه",
        label: "شرق التفريعه",
      },
      {
        value: "الرسوه",
        label: "الرسوه",
      },
    ],
  },
  // دمياط تمام 12
  {
    value: "دمياط",
    label: "دمياط",
    children: [
      {
        value: "دمياط",
        label: "دمياط",
      },
      {
        value: "رأس البر",
        label: "رأس البر",
      },
      {
        value: "عزبة البرج",
        label: "عزبة البرج",
      },
      {
        value: "فارسكور",
        label: "فارسكور",
      },
      {
        value: "الروضة",
        label: "الروضة",
      },
      {
        value: "الزرقا",
        label: "الزرقا",
      },
      {
        value: "السرو",
        label: "السرو",
      },
      {
        value: "كفر سعد",
        label: "كفر سعد",
      },
      {
        value: "ميت أبو غالب",
        label: "ميت أبو غالب",
      },
      {
        value: "كفر البطيخ",
        label: "كفر البطيخ",
      },
      {
        value: "دمياط الجديدة",
        label: "دمياط الجديدة",
      },
    ],
  },
  // منوفية تمام 3
  {
    value: "المنوفية",
    label: "المنوفية",
    children: [
      {
        value: "منوفية",
        label: "منوفية",
      },
      {
        value: "أشمون",
        label: "أشمون",
      },
      {
        value: "الباجور",
        label: "الباجور",
      },
      {
        value: "بركة السبع",
        label: "بركة السبع",
      },
      {
        value: "تلا",
        label: "تلا",
      },
      {
        value: "السادات",
        label: "السادات",
      },
      {
        value: "شبين الكوم",
        label: "شبين الكوم",
      },
      {
        value: "الشهداء",
        label: "الشهداء",
      },
      {
        value: "قويسنا",
        label: "قويسنا",
      },
      {
        value: "منوف",
        label: "منوف",
      },
    ],
  },
  // القليوبية تمام 14
  {
    value: "القلوبية",
    label: "القلوبية",
    children: [
      {
        value: "قليوبية",
        label: "قليوبية",
      },
      {
        value: "بنها",
        label: "بنها",
      },
      {
        value: "قليوب",
        label: "قليوب",
      },
      {
        value: "القناطر الخيرية",
        label: "القناطر الخيرية",
      },
      {
        value: "شبرا الخيمة",
        label: "شبرا الخيمة",
      },
      {
        value: "الخانكة",
        label: "الخانكة",
      },
      {
        value: "كفر شكر",
        label: "كفر شكر",
      },
      {
        value: "شبين القناطر",
        label: "شبين القناطر",
      },
      {
        value: "طوخ",
        label: "طوخ",
      },
      {
        value: "العبور (قليوبية)",
        label: "العبور (قليوبية)",
      },
      {
        value: "قها (قليوبية)",
        label: "قها (قليوبية)",
      },
      {
        value: "الخصوص",
        label: "الخصوص",
      },
    ],
  },
  // كفر الشيخ تمام 15
  {
    value: "كفر الشيخ",
    label: "كفر الشيخ",
    children: [
      {
        value: "البرلس",
        label: "البرلس",
      },
      {
        value: "بيلا",
        label: "بيلا",
      },
      {
        value: "الحامول",
        label: "الحامول",
      },
      {
        value: "دسوق",
        label: "دسوق",
      },
      {
        value: "الرياض",
        label: "الرياض",
      },
      {
        value: "سيدي سالم",
        label: "سيدي سالم",
      },
      {
        value: "فوه",
        label: "فوه",
      },
      {
        value: "قلين",
        label: "قلين",
      },

      {
        value: "كفر الشيخ",
        label: "كفر الشيخ",
      },
      {
        value: "مطوبس",
        label: "مطوبس",
      },
    ],
  },
  // بني سويف تمام 16
  {
    value: "بني سويف",
    label: "بني سويف",
    children: [
      {
        value: "إهناسيا",
        label: "إهناسيا",
      },
      {
        value: "ببا",
        label: "ببا",
      },
      {
        value: "بني سويف",
        label: "بني سويف",
      },
      {
        value: "سمسطا",
        label: "سمسطا",
      },
      {
        value: "الفشن",
        label: "الفشن",
      },
      {
        value: "ناصر",
        label: "ناصر",
      },
      {
        value: "الواسطى",
        label: "الواسطى",
      },
    ],
  },
  // المنيا تمام 17
  {
    value: "المنيا",
    label: "المنيا",
    children: [
      {
        value: "أبو قرقاص",
        label: "أبو قرقاص",
      },
      {
        value: "بني مزار",
        label: "بني مزار",
      },
      {
        value: "دير مواس",
        label: "دير مواس",
      },
      {
        value: "سمالوط",
        label: "سمالوط",
      },
      {
        value: "العدوة",
        label: "العدوة",
      },
      {
        value: "مطاي",
        label: "مطاي",
      },
      {
        value: "مغاغة",
        label: "مغاغة",
      },
      {
        value: "ملوي",
        label: "ملوي",
      },
      {
        value: "منيا",
        label: "منيا",
      },
    ],
  },
  // اسيوط تمام 18
  {
    value: "اسيوط",
    label: "اسيوط",
    children: [
      {
        value: "أبنوب",
        label: "أبنوب",
      },
      {
        value: "أبو تيج",
        label: "أبو تيج",
      },
      {
        value: "أسيوط",
        label: "أسيوط",
      },
      {
        value: "البداري",
        label: "البداري",
      },
      {
        value: "ديروط",
        label: "ديروط",
      },
      {
        value: "ساحل سليم",
        label: "ساحل سليم",
      },
      {
        value: "صدفا",
        label: "صدفا",
      },
      {
        value: "الغنايم",
        label: "الغنايم",
      },
      {
        value: "الفتح",
        label: "الفتح",
      },
      {
        value: "القوصية",
        label: "القوصية",
      },
      {
        value: "منفلوط",
        label: "منفلوط",
      },
    ],
  },
  // سوهاج تمام 19
  {
    value: "سوهاج",
    label: "سوهاج",
    children: [
      {
        value: "أخميم",
        label: "أخميم",
      },
      {
        value: "البلينا",
        label: "البلينا",
      },
      {
        value: "جرجا",
        label: "جرجا",
      },
      {
        value: "جهينة",
        label: "جهينة",
      },
      {
        value: "دار السلام",
        label: "دار السلام",
      },
      {
        value: "ساقلته",
        label: "ساقلته",
      },
      {
        value: "سوهاج",
        label: "سوهاج",
      },
      {
        value: "طما",
        label: "طما",
      },
      {
        value: "طهطا",
        label: "طهطا",
      },
      {
        value: "المراغة",
        label: "المراغة",
      },
      {
        value: "المنشأة",
        label: "المنشأة",
      },
    ],
  },
  // قنا تمام 19

  {
    value: "قنا",
    label: "قنا",
    children: [
      {
        value: "أبو تشت",
        label: "أبو تشت",
      },
      {
        value: "دشنا",
        label: "دشنا",
      },
      {
        value: "فرشوط",
        label: "فرشوط",
      },
      {
        value: "قفط",
        label: "قفط",
      },
      {
        value: "قنا",
        label: "قنا",
      },
      {
        value: "قوص",
        label: "قوص",
      },
      {
        value: "نجع حمادي",
        label: "نجع حمادي",
      },
      {
        value: "نقادة",
        label: "نقادة",
      },
      {
        value: "الوقف",
        label: "الوقف",
      },
    ],
  },
  // الاقصر تمام 20

  {
    value: "الاقصر",
    label: "الاقصر",
    children: [
      {
        value: "اقصر",
        label: "اقصر",
      },
      {
        value: "أرمنت",
        label: "أرمنت",
      },
      {
        value: "إسنا",
        label: "إسنا",
      },
      {
        value: "البياضية",
        label: "البياضية",
      },
      {
        value: "الزينية",
        label: "الزينية",
      },
      {
        value: "الطود",
        label: "الطود",
      },
      {
        value: "القرنة",
        label: "القرنة",
      },
    ],
  },
  // اسوان تمام 21

  {
    value: "اسوان",
    label: "اسوان",
    children: [
      {
        value: "أسوان",
        label: "أسوان",
      },
      {
        value: "إدفو",
        label: "إدفو",
      },
      {
        value: "دراو",
        label: "دراو",
      },
      {
        value: "كوم أمبو",
        label: "كوم أمبو",
      },
      {
        value: "نصر النوبة",
        label: "نصر النوبة",
      },
    ],
  },
  // الوادي الجديد تمام 22

  {
    value: "الوادي الجديد",
    label: "الوادي الجديد",
    children: [
      {
        value: "الوادي الجديد",
        label: "الوادي الجديد",
      },
      {
        value: "الخارجة",
        label: "الخارجة",
      },
      {
        value: "باريس",
        label: "باريس",
      },
      {
        value: "بلاط",
        label: "بلاط",
      },
      {
        value: "الفرافرة",
        label: "الفرافرة",
      },
    ],
  },
  //  جنوب سينا تمام23

  
  // مطروح 24
  {
    value: "مطروح",
    label: "مطروح",
    children: [
      {
        value: "كز الحمام",
        label: "كز الحمام",
      },
      {
        value: "العلمين",
        label: "العلمين",
      },
      {
        value: "الضبعة",
        label: "الضبعة",
      },
      {
        value: "مرسى مطروح",
        label: "مرسى مطروح",
      },
      {
        value: "النجيلة",
        label: "النجيلة",
      },
      {
        value: "براني",
        label: "براني",
      },
      {
        value: "السلوم",
        label: "السلوم",
      },
      {
        value: "سيوة",
        label: "سيوة",
      },
    ],
  },
  // 25 البحر الاحمر
  {
    value: "البحر الاحمر",
    label: "البحر الاحمر",
    children: [
      {
        value: "رأس غارب",
        label: "رأس غارب",
      },
      {
        value: "الغردقة",
        label: "الغردقة",
      },
      {
        value: "القصير",
        label: "القصير",
      },
      {
        value: "سفاجا",
        label: "سفاجا",
      },
      {
        value: "مرسى علم",
        label: "مرسى علم",
      },
      {
        value: "شلاتين",
        label: "شلاتين",
      },
      {
        value: "حلايب",
        label: "حلايب",
      },
    ],
  },
  // جنوب سينا 26
  {
    value: "جنوب سينا",
    label: "جنوب سينا",
    children: [
      {
        value: "أبو رديس",
        label: "أبو رديس",
      },
      {
        value: "أبو زنيمة",
        label: "أبو زنيمة",
      },
      {
        value: "نويبع",
        label: "نويبع",
      },
      {
        value: "طابا",
        label: "طابا",
      },
      {
        value: "رأس سدر",
        label: "رأس سدر",
      },
      {
        value: "دهب",
        label: "دهب",
      },
      {
        value: "شرم الشيخ",
        label: "شرم الشيخ",
      },
      {
        value: "سانت كاترين",
        label: "سانت كاترين",
      },
      {
        value: "الطور",
        label: "الطور",
      },
    ],
  },
];
export default countryptions;
